Обработки/Reports/_ОтчетОРезультатахВладенияПаями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОРезультатахВладенияПаями</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОРезультатахВладенияПаями/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС ДЛЯ ВКЛЮЧЕНИЯ В ДОП. ОТЧЕТЫ И ОБРАБОТКИ

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительныйОтчет", "Отчет о результатах владения паями", "0.15", "", Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

#Область ФормированиеОтчета

Функция ПолучитьПредставлениеЮрФизЛица(ЮрФизЛицо)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыФизическихЛицСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицСрезПоследних.Отчество КАК Представление
	|ИЗ
	|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|				И ЮрФизЛицо = &ЮрФизЛицо) КАК РеквизитыФизическихЛицСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу
	|ИЗ
	|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|				И ЮрФизЛицо = &ЮрФизЛицо) КАК РеквизитыЮридическихЛицСрезПоследних");
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо",     ЮрФизЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПредставлениеПайщика = Выборка.Представление;
	Иначе
		ПредставлениеПайщика = "";
	КонецЕсли;
	
	Возврат ПредставлениеПайщика;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Дата,Пайщик,Организация");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументРезультат.Очистить();
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб        = Истина;
	
	МакетОтчета = ПолучитьМакет("Макет");
	
	ОбластьШапка = МакетОтчета.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Пайщик = ПолучитьПредставлениеЮрФизЛица(Пайщик);
	ОбластьШапка.Параметры.УправляющаяКомпания = ПолучитьПредставлениеЮрФизЛица(Организация.ЮрФизЛицо);
	
	ОбластьШапка.Рисунки.Логотип.Картинка = Новый Картинка(ПолучитьОбщийМакет("ЛоготипРЭМ"), Истина);
	
	ДокументРезультат.Вывести(ОбластьШапка);
	ДокументРезультат.Вывести(МакетОтчета.ПолучитьОбласть("ЗаголовокОбщейТаблицы"));
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
	|	ВЫРАЗИТЬ(РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда КАК СТРОКА(255)) КАК НаименованиеПИФ,
	|	ВложенныйЗапрос.ДатаПриобретения КАК ДатаПриобретения,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.Себестоимость КАК Себестоимость,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	ВложенныйЗапрос.ЦенаСебестоимость КАК ЦенаСебестоимость,
	|	ВложенныйЗапрос.Стоимость КАК Стоимость,
	|	ВложенныйЗапрос.ДнейВУправлении КАК ДнейВУправлении,
	|	ВложенныйЗапрос.Стоимость - ВложенныйЗапрос.Себестоимость КАК ФинансовыйРезультат,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ДнейВУправлении = 0
	|				ИЛИ ВложенныйЗапрос.Себестоимость = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(365 * 100 * (ВложенныйЗапрос.Стоимость - ВложенныйЗапрос.Себестоимость) / ВложенныйЗапрос.Себестоимость / ВложенныйЗапрос.ДнейВУправлении КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК Доходность
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДолиПайщиков.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
	|		НАЧАЛОПЕРИОДА(ДолиПайщиков.Партия.Дата, ДЕНЬ) КАК ДатаПриобретения,
	|		СУММА(ДолиПайщиков.КоличествоОстаток) КАК Количество,
	|		СУММА(ДолиПайщиков.СтоимостьОстаток) КАК Себестоимость,
	|		МАКСИМУМ(ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0)) КАК Цена,
	|		ВЫБОР
	|			КОГДА СУММА(ДолиПайщиков.КоличествоОстаток) = 0
	|				ТОГДА 0
	|			ИНАЧЕ СУММА(ДолиПайщиков.СтоимостьОстаток) / СУММА(ДолиПайщиков.КоличествоОстаток)
	|		КОНЕЦ КАК ЦенаСебестоимость,
	|		МАКСИМУМ(ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0)) * СУММА(ДолиПайщиков.КоличествоОстаток) КАК Стоимость,
	|		РАЗНОСТЬДАТ(ДолиПайщиков.Партия.Дата, &Период, ДЕНЬ) КАК ДнейВУправлении
	|	ИЗ
	|		РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Остатки(
	|				&Период,
	|				Организация = &Организация
	|					И Пайщик = &Пайщик) КАК ДолиПайщиков
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Дата, ) КАК КлиентыДоверительногоУправленияСрезПоследних
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
	|				ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики
	|					И (ФинансовыеПоказатели.Организация = &Организация)
	|					И (ФинансовыеПоказатели.ВидПоказателя = &ВидПоказателя)
	|					И (ФинансовыеПоказатели.Период = &ДатаСЧА)
	|			ПО ДолиПайщиков.ПаевойИнвестиционныйФонд = КлиентыДоверительногоУправленияСрезПоследних.Клиент
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДолиПайщиков.ПаевойИнвестиционныйФонд,
	|		НАЧАЛОПЕРИОДА(ДолиПайщиков.Партия.Дата, ДЕНЬ),
	|		РАЗНОСТЬДАТ(ДолиПайщиков.Партия.Дата, &Период, ДЕНЬ)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
	|		ПО ВложенныйЗапрос.ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПаевойИнвестиционныйФонд,
	|	ДатаПриобретения
	|ИТОГИ
	|	МАКСИМУМ(НаименованиеПИФ),
	|	СУММА(Количество),
	|	СУММА(Себестоимость),
	|	МАКСИМУМ(Цена),
	|	СУММА(Стоимость),
	|	СУММА(ФинансовыйРезультат),
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Себестоимость * ВложенныйЗапрос.ДнейВУправлении) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(365 * 100 * СУММА(ВложенныйЗапрос.Стоимость - ВложенныйЗапрос.Себестоимость) / СУММА(ВложенныйЗапрос.Себестоимость * ВложенныйЗапрос.ДнейВУправлении) КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК Доходность
	|ПО
	|	ОБЩИЕ,
	|	ПаевойИнвестиционныйФонд
	|АВТОУПОРЯДОЧИВАНИЕ");
	
	Запрос.УстановитьПараметр("Период",  Дата + 86400);
	Запрос.УстановитьПараметр("Дата",    Дата);
	Запрос.УстановитьПараметр("ДатаСЧА", Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, Дата));
	Запрос.УстановитьПараметр("Пайщик",  Пайщик);
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("ВидПоказателя", Справочники.ВидыФинансовыхПоказателей.СтоимостьПая);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаОбщая = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщая.Следующий() Тогда
		
		ОбластьПодвал = МакетОтчета.ПолучитьОбласть("ПодвалОбщейТаблицы");
		ОбластьПодвал.Параметры.Заполнить(ВыборкаОбщая);
		
		ОбластьСтрока = МакетОтчета.ПолучитьОбласть("СтрокаОбщейТаблицы");
		
		Выборка = ВыборкаОбщая.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			ДокументРезультат.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ДокументРезультат.Вывести(ОбластьПодвал);
		
		Выборка.Сбросить();
		
		ДокументРезультат.Вывести(МакетОтчета.ПолучитьОбласть("ОбластьРазделитель"));
		
		ОбластьЗаголовок = МакетОтчета.ПолучитьОбласть("ЗаголовокТаблицыПИФ");
		ОбластьСтрока    = МакетОтчета.ПолучитьОбласть("СтрокаТаблицыПИФ");
		ОбластьПодвал    = МакетОтчета.ПолучитьОбласть("ПодвалТаблицыПИФ");
		
		Пока Выборка.Следующий() Цикл
			
			ОбластьЗаголовок.Параметры.Заполнить(Выборка);
			ДокументРезультат.Вывести(ОбластьЗаголовок);
			
			ВыборкаДетали = Выборка.Выбрать();
			
			Пока ВыборкаДетали.Следующий() Цикл
				
				ОбластьСтрока.Параметры.Заполнить(ВыборкаДетали);
				ДокументРезультат.Вывести(ОбластьСтрока);
				
			КонецЦикла;
			
			ОбластьПодвал.Параметры.Заполнить(Выборка);
			ДокументРезультат.Вывести(ОбластьПодвал);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

#КонецОбласти
